IDEA Open Model
ConcreteCheckResults Class
Compatible with IDEA StatiCa Beta 20.0
 Concrete Check results
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResults
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class ConcreteCheckResults
Public Class ConcreteCheckResults
The ConcreteCheckResults type exposes the following members.
Constructors
Name | Description
ConcreteCheckResults
 Constructor
Top
Properties
Name | Description
CheckResults
 All results
Overall
 Overal check
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace